MS_Lectures.org
#+TITLE: Моделирование систем
#+AUTHOR: Максим Захаров
#+STARTUP: indent
#+INFOJS_OPT: path:other/org-info.js view:content ltoc:nil ftoc:t tdepth:1
#+INCLUDE: "other/metrika.org"

[[file:index.org][На главную]] | [[file:other/MS_Lectures.pdf][Скачать в PDF]]

* Общие сведения
  CLOCK: [2010-09-14 Втр 10:01]

/Модель/ --- это логические схемы, упрощающие рассуждения или логические построения, позволяющие проводить эксперименты, уточняющие природу явлений.

/Моделирование/ --- это замещение одного объекта другим с целью получения информации о свойствах объекта-оригинала с помощью объекта-модели.

Объектом-оригиналом может быть любая естественная или искусственная, реальная или воображаемая система.

Система характеризуется своими свойствами и имеет некоторое множество параметров. Параметры системы отражают её внутреннее содержание, т. е. структура и принципы функционирования.

Набор параметров и их значения выделяют систему среди всех остальных систем.

Количественной мерой свойств системы служит характеристики. /Характеристики/ --- это внешние признаки, которые важны при взаимодействии с другими системами.

Оригинал и модель сходны по некоторым параметрам и могут быть различны по другим. Замещение объекта моделью возможно, если интересующие исследователя характеристики оригинала модели определяются одинаковыми параметрами и связаны одинаковыми зависимостями с этими параметрами при одинаковых внешних воздействиях за определённый интервал времени.

Моделирование целесообразно проводить, когда у модели отсутствуют те признаки оригинала, которые препятствуют его исследованию или имеются отличные от оригинал параметры, способствующие изучению свойств модели.

Моделирование используется на этапе проектирования новых устройств или систем, для анализа вариантов проектных решений с целью выбора оптимального по заданным критериям; для анализа функционирования действующих систем в экстремальных условиях или при изменении их состава, структуры, способов управления или рабочей нагрузки.

* Классификация видов моделирования

В зависимости от формы представления объекта бывает мысленное моделирование и реальное моделирование.

** Мысленное моделирование

/Мысленное моделирование/ бывает 3 видов:
1) Наглядное.
2) Символическое.
3) Математическое.

/Математическое моделирование/ --- это процесс установления соответствия реальному объекту некоторого математического объекта (модели) и исследование этой модели, позволяющее получать характеристики рассматриваемого объекта. Вид математической модели зависит от природы реального объекта, от задач исследования объекта и от требуемой достоверности и точности решения этой задачи.

Математическое моделирования делится на 3 вида:
1) Аналитическое. Модель записывается в виде функциональных отношений (алгебраических, дифференциальных, интегральных и т. п.).
2) Имитационное. Составляется алгоритм функционирования системы во времени.
3) Комбинированное.

** Реальное моделирование

При реальном моделировании интересующие исследователя характеристики изучаются на реальном объекте или на его части.

Реальное моделирование бывает:
1) Натурное. Проводятся научные эксперименты на реальном объекте.
2) Физическое. При этом исследования проводятся на специальных установках, которые сохраняют природу явления и обладают физическим подобием.

Самым достоверным из всех видов моделирования является натурное моделирование.

Наиболее широко применяемым видом моделирования является математическое. Аналитическое моделирование может быть применено только для систем, для которых точно известны математические зависимости между характеристиками, параметрами системы и внешними воздействиями на неё. Если это известно, то используется имитационное моделирование.

* Классификация моделей

