html/MS_Lectures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Моделирование систем</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-04 14:43:08 MSK"/>
<meta name="author" content="Максим Захаров"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Моделирование систем</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Общие сведения </a></li>
<li><a href="#sec-2">2 Классификация видов моделирования </a>
<ul>
<li><a href="#sec-2_1">2.1 Мысленное моделирование </a></li>
<li><a href="#sec-2_2">2.2 Реальное моделирование </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Классификация моделей </a>
<ul>
<li><a href="#sec-3_1">3.1 Физические модели </a></li>
<li><a href="#sec-3_2">3.2 Математические модели </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Основные этапы моделирования </a>
<ul>
<li><a href="#sec-4_1">4.1 Постановка цели моделирования </a></li>
<li><a href="#sec-4_2">4.2 Разработка концептуальной модели </a></li>
<li><a href="#sec-4_3">4.3 Подготовка исходных данных </a></li>
<li><a href="#sec-4_4">4.4 Разработка математической модели </a></li>
<li><a href="#sec-4_5">4.5 Разработка физической модели </a></li>
<li><a href="#sec-4_6">4.6 Разработка имитационной модель </a></li>
<li><a href="#sec-4_7">4.7 Выбор метода моделирования </a></li>
<li><a href="#sec-4_8">4.8 Выбор средств моделирования </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Пример </a></li>
<li><a href="#sec-6">6 Испытание модели </a></li>
<li><a href="#sec-7">7 Исследование свойств модели </a>
<ul>
<li><a href="#sec-7_1">7.1 Проверка генераторов ПСЧ, используемых в модели: </a>
<ul>
<li><a href="#sec-7_1_1">7.1.1 Проверка соответствия закону распределения. </a></li>
<li><a href="#sec-7_1_2">7.1.2 Проверка корреляции чисел </a></li>
<li><a href="#sec-7_1_3">7.1.3 Комбинаторный тест </a></li>
</ul>
</li>
<li><a href="#sec-7_2">7.2 Определение длительности переходного режима в модели </a></li>
<li><a href="#sec-7_3">7.3 Оценка дисперсии результатов моделирования </a></li>
<li><a href="#sec-7_4">7.4 Планирование экспериментов </a></li>
<li><a href="#sec-7_5">7.5 Определение требуемого размера выборки </a></li>
<li><a href="#sec-7_6">7.6 Определение интервалов изменения параметров </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Документация результатов моделирования </a></li>
<li><a href="#sec-9">9 Лабораторные работы </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Общие сведения </h2>
<div class="outline-text-2" id="text-1">


<p>
<i>Модель</i> &mdash; это логические схемы, упрощающие рассуждения или логические построения, позволяющие проводить эксперименты, уточняющие природу явлений.
</p>
<p>
<i>Моделирование</i> &mdash; это замещение одного объекта другим с целью получения информации о свойствах объекта-оригинала с помощью объекта-модели.
</p>
<p>
Объектом-оригиналом может быть любая естественная или искусственная, реальная или воображаемая система.
</p>
<p>
Система характеризуется своими свойствами и имеет некоторое множество параметров. Параметры системы отражают её внутреннее содержание, т. е. структура и принципы функционирования.
</p>
<p>
Набор параметров и их значения выделяют систему среди всех остальных систем.
</p>
<p>
Количественной мерой свойств системы служит характеристики. <i>Характеристики</i> &mdash; это внешние признаки, которые важны при взаимодействии с другими системами.
</p>
<p>
Оригинал и модель сходны по некоторым параметрам и могут быть различны по другим. Замещение объекта моделью возможно, если интересующие исследователя характеристики оригинала модели определяются одинаковыми параметрами и связаны одинаковыми зависимостями с этими параметрами при одинаковых внешних воздействиях за определённый интервал времени.
</p>
<p>
Моделирование целесообразно проводить, когда у модели отсутствуют те признаки оригинала, которые препятствуют его исследованию или имеются отличные от оригинал параметры, способствующие изучению свойств модели.
</p>
<p>
Моделирование используется на этапе проектирования новых устройств или систем, для анализа вариантов проектных решений с целью выбора оптимального по заданным критериям; для анализа функционирования действующих систем в экстремальных условиях или при изменении их состава, структуры, способов управления или рабочей нагрузки.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Классификация видов моделирования </h2>
<div class="outline-text-2" id="text-2">


<p>
В зависимости от формы представления объекта бывает мысленное моделирование и реальное моделирование.
</p>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Мысленное моделирование </h3>
<div class="outline-text-3" id="text-2_1">


<p>
<i>Мысленное моделирование</i> бывает 3 видов:
</p><ol>
<li>
Наглядное.
</li>
<li>
Символическое.
</li>
<li>
Математическое.
</li>
</ol>


<p>
<i>Математическое моделирование</i> &mdash; это процесс установления соответствия реальному объекту некоторого математического объекта (модели) и исследование этой модели, позволяющее получать характеристики рассматриваемого объекта. Вид математической модели зависит от природы реального объекта, от задач исследования объекта и от требуемой достоверности и точности решения этой задачи.
</p>
<p>
Математическое моделирования делится на 3 вида:
</p><ol>
<li>
Аналитическое. Модель записывается в виде функциональных отношений (алгебраических, дифференциальных, интегральных и т. п.).
</li>
<li>
Имитационное. Составляется алгоритм функционирования системы во времени.
</li>
<li>
Комбинированное.
</li>
</ol>


</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Реальное моделирование </h3>
<div class="outline-text-3" id="text-2_2">


<p>
При реальном моделировании интересующие исследователя характеристики изучаются на реальном объекте или на его части.
</p>
<p>
Реальное моделирование бывает:
</p><ol>
<li>
Натурное. Проводятся научные эксперименты на реальном объекте.
</li>
<li>
Физическое. При этом исследования проводятся на специальных установках, которые сохраняют природу явления и обладают физическим подобием.
</li>
</ol>


<p>
Самым достоверным из всех видов моделирования является натурное моделирование.
</p>
<p>
Наиболее широко применяемым видом моделирования является математическое. Аналитическое моделирование может быть применено только для систем, для которых точно известны математические зависимости между характеристиками, параметрами системы и внешними воздействиями на неё. Если это известно, то используется имитационное моделирование.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Классификация моделей </h2>
<div class="outline-text-2" id="text-3">



</div>
