other/MS_Lectures.tex
% Created 2011-01-05 Ср. 20:59
\documentclass[12pt, russian, oneside, article]{ncc}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[math]{pscyr}
\usepackage{indentfirst}
\providecommand{\alert}[1]{\textbf{#1}}
\begin{document}



\title{Моделирование систем}
\author{Максим Захаров}
\date{05 Январь 2011}
\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\href{file://~/Documents/Git/lectures/other~/Documents/Git/zamal.github.com/pdf/MS_Lectures.pdf}{Скачать в PDF}

\section{Общие сведения}
\label{sec-1}


\emph{Модель} --- это логические схемы, упрощающие рассуждения или логические построения, позволяющие проводить эксперименты, уточняющие природу явлений.

\emph{Моделирование} --- это замещение одного объекта другим с целью получения информации о свойствах объекта-оригинала с помощью объекта-модели.

Объектом-оригиналом может быть любая естественная или искусственная, реальная или воображаемая система.

Система характеризуется своими свойствами и имеет некоторое множество параметров. Параметры системы отражают её внутреннее содержание, т. е. структура и принципы функционирования.

Набор параметров и их значения выделяют систему среди всех остальных систем.

Количественной мерой свойств системы служит характеристики. \emph{Характеристики} --- это внешние признаки, которые важны при взаимодействии с другими системами.

Оригинал и модель сходны по некоторым параметрам и могут быть различны по другим. Замещение объекта моделью возможно, если интересующие исследователя характеристики оригинала модели определяются одинаковыми параметрами и связаны одинаковыми зависимостями с этими параметрами при одинаковых внешних воздействиях за определённый интервал времени.

Моделирование целесообразно проводить, когда у модели отсутствуют те признаки оригинала, которые препятствуют его исследованию или имеются отличные от оригинал параметры, способствующие изучению свойств модели.

Моделирование используется на этапе проектирования новых устройств или систем, для анализа вариантов проектных решений с целью выбора оптимального по заданным критериям; для анализа функционирования действующих систем в экстремальных условиях или при изменении их состава, структуры, способов управления или рабочей нагрузки.
\section{Классификация видов моделирования}
\label{sec-2}


В зависимости от формы представления объекта бывает мысленное моделирование и реальное моделирование.
\subsection{Мысленное моделирование}
\label{sec-2_1}


\emph{Мысленное моделирование} бывает 3 видов:
\begin{enumerate}
\item Наглядное.
\item Символическое.
\item Математическое.
\end{enumerate}

\emph{Математическое моделирование} --- это процесс установления соответствия реальному объекту некоторого математического объекта (модели) и исследование этой модели, позволяющее получать характеристики рассматриваемого объекта. Вид математической модели зависит от природы реального объекта, от задач исследования объекта и от требуемой достоверности и точности решения этой задачи.

Математическое моделирования делится на 3 вида:
\begin{enumerate}
\item Аналитическое. Модель записывается в виде функциональных отношений (алгебраических, дифференциальных, интегральных и т. п.).
\item Имитационное. Составляется алгоритм функционирования системы во времени.
\item Комбинированное.
\end{enumerate}
\subsection{Реальное моделирование}
\label{sec-2_2}


При реальном моделировании интересующие исследователя характеристики изучаются на реальном объекте или на его части.

Реальное моделирование бывает:
\begin{enumerate}
\item Натурное. Проводятся научные эксперименты на реальном объекте.
\item Физическое. При этом исследования проводятся на специальных установках, которые сохраняют природу явления и обладают физическим подобием.
\end{enumerate}

Самым достоверным из всех видов моделирования является натурное моделирование.

Наиболее широко применяемым видом моделирования является математическое. Аналитическое моделирование может быть применено только для систем, для которых точно известны математические зависимости между характеристиками, параметрами системы и внешними воздействиями на неё. Если это известно, то используется имитационное моделирование.
\section{Классификация моделей}
\label{sec-3}
