html/MS_Lectures.html

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Физические модели </h3>
<div class="outline-text-3" id="text-3_1">


<p>
В основу классификации положена степень абстрагирования модели от оригинала.
</p>
<p>
<i>Физическая модель</i> &mdash; это система, которая эквивалентна или подобна оригиналу, либо у которой процесс функционирования такой же, как у оригинала и имеет такую же или другую физическую природу.
</p>
<p>
Этих моделей 4 вида:
</p><ol>
<li>
Натурная модель. Это реально исследуемая система.
</li>
<li>
Квазинатурная модель. Совокупность натурных и математических моделей. Часть системы существует реально, а другая часть система ещё не создана.
</li>
<li>
Масштабная модель. Эта система той же физической природы, что и оригинал, но отличающаяся от него масштабом.
</li>
<li>
Аналоговая модель. Это система, имеющая физическую природу, отличающуюся от оригинала. При этом процессы функционирования должны быть сходны.
</li>
</ol>


</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Математические модели </h3>
<div class="outline-text-3" id="text-3_2">


<p>
<i>Математическая модель</i> &mdash; это формализованное описание системы с помощью какого-то абстрактного языка (алгоритм, схемы, чертежи).
</p>
<ol>
<li>
Аналитическая модель.
</li>
<li>
Имитационная.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Основные этапы моделирования </h2>
<div class="outline-text-2" id="text-4">


<ol>
<li>
Постановка цели моделирования.
</li>
<li>
Разработка концептуальной модели.
</li>
<li>
Подготовка исходных данных.
</li>
<li>
Разработка математической или физической модели.
</li>
<li>
Выбор метода моделирования.
</li>
<li>
Выбор средств моделирования.
</li>
<li>
Проверка адекватности и корректировка модели.
</li>
<li>
Планирование экспериментов с моделью.
</li>
<li>
Проведение экспериментов с моделью.
</li>
<li>
Анализ результатов моделирования.
</li>
</ol>



</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Постановка цели моделирования </h3>
<div class="outline-text-3" id="text-4_1">


<p>
Постановка цели является самым важным этапом моделирования. На этом этапе производится установление границ и ограничений при моделировании, выбор показателей для сравнения эффективности различных вариантов между собой и составляется содержательное описание объекта моделирования.
</p>
<p>
Для сравнения вариантов может быть использован один критерий (однокритериальная оценка) или сразу несколько (многокритериальная оценка).
</p>
<p>
Задание границ предусматривает задание временных интервалов, на которых изучается система, и устанавливаются минимальное и максимальное внешние воздействия на систему, определяется какие виды воздействия могут быть одновременно. При этом проводится некоторая идеализация условий функционирования системы за счёт отбрасывания некоторых факторов, которые являются несущественными для достижения цели моделирования.
</p>
<p>
Этап заканчивается оценкой материальных затрат на создание модели.
</p>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Разработка концептуальной модели </h3>
<div class="outline-text-3" id="text-4_2">


<p>
<i>Концептуальная модель</i> &mdash; это абстрактная модель, определяющая состав и структуру системы, свойства элементов и причинно-следственные связи, существенные для достижения цели моделирования.
</p>
<p>
В концептуальной модели в словесной форме приводятся описание объекта моделирования, необходимое для достижения цели моделирования, список параметров, которые будут моделироваться, критерии для сравнения вариантов системы, способы представления результатов моделирования.
</p>
<p>
На этом этапе определяется язык формализации модели и способ проведения её исследований (для математической модели).
</p>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Подготовка исходных данных </h3>
<div class="outline-text-3" id="text-4_3">


<p>
Сначала определяется какие качественные параметры будут использоваться в модели Эти параметры отвечают за конкретную процедуру выполнения каких либо операций.
</p>
<p>
Для определения диапазона изменения количественных параметров &hellip; фактические данные об условиях, в которых будет работать или уже работает объект-оригинал. При этом т. к. большая часть параметров являются случайными величинами для создания их модели необходимо подобрать закон распределения этих величин.
</p>
<p>
Для каждого элемента системы существут функциональная связь между входным воздействием на него и его выходной характеристикой. Для некоторых элементов эта функциональная зависимость является очевидной, и её можно описать математическим выражением.
</p>
<p>
Для проверки правильности выбранного выражения для существующих систем проводятся сравнения расчётов по выражению и экспериментальных данных.
</p>
<p>
Если &hellip; , то исследователь выдвигает гипотезы о возможных значениях параметров модели. При этом используются экспертные оценки, результаты исследования других система подобного назначения, личный опыт и интуиция создателей модели.
</p>
<p>
В конце этого этапа строится таблица, в которую заносятся все переменные и их значения.
</p>
</div>

</div>
