other/MS_Lectures.tex
\subsection{Физические модели}
\label{sec-3_1}


В основу классификации положена степень абстрагирования модели от оригинала.

\emph{Физическая модель} --- это система, которая эквивалентна или подобна оригиналу, либо у которой процесс функционирования такой же, как у оригинала и имеет такую же или другую физическую природу.

Этих моделей 4 вида:
\begin{enumerate}
\item Натурная модель. Это реально исследуемая система.
\item Квазинатурная модель. Совокупность натурных и математических моделей. Часть системы существует реально, а другая часть система ещё не создана.
\item Масштабная модель. Эта система той же физической природы, что и оригинал, но отличающаяся от него масштабом.
\item Аналоговая модель. Это система, имеющая физическую природу, отличающуюся от оригинала. При этом процессы функционирования должны быть сходны.
\end{enumerate}
\subsection{Математические модели}
\label{sec-3_2}


\emph{Математическая модель} --- это формализованное описание системы с помощью какого-то абстрактного языка (алгоритм, схемы, чертежи).

\begin{enumerate}
\item Аналитическая модель.
\item Имитационная.
\end{enumerate}
\section{Основные этапы моделирования}
\label{sec-4}


\begin{enumerate}
\item Постановка цели моделирования.
\item Разработка концептуальной модели.
\item Подготовка исходных данных.
\item Разработка математической или физической модели.
\item Выбор метода моделирования.
\item Выбор средств моделирования.
\item Проверка адекватности и корректировка модели.
\item Планирование экспериментов с моделью.
\item Проведение экспериментов с моделью.
\item Анализ результатов моделирования.
\end{enumerate}
\subsection{Постановка цели моделирования}
\label{sec-4_1}


Постановка цели является самым важным этапом моделирования. На этом этапе производится установление границ и ограничений при моделировании, выбор показателей для сравнения эффективности различных вариантов между собой и составляется содержательное описание объекта моделирования.

Для сравнения вариантов может быть использован один критерий (однокритериальная оценка) или сразу несколько (многокритериальная оценка).

Задание границ предусматривает задание временных интервалов, на которых изучается система, и устанавливаются минимальное и максимальное внешние воздействия на систему, определяется какие виды воздействия могут быть одновременно. При этом проводится некоторая идеализация условий функционирования системы за счёт отбрасывания некоторых факторов, которые являются несущественными для достижения цели моделирования.

Этап заканчивается оценкой материальных затрат на создание модели.
\subsection{Разработка концептуальной модели}
\label{sec-4_2}


\emph{Концептуальная модель} --- это абстрактная модель, определяющая состав и структуру системы, свойства элементов и причинно-следственные связи, существенные для достижения цели моделирования.

В концептуальной модели в словесной форме приводятся описание объекта моделирования, необходимое для достижения цели моделирования, список параметров, которые будут моделироваться, критерии для сравнения вариантов системы, способы представления результатов моделирования.

На этом этапе определяется язык формализации модели и способ проведения её исследований (для математической модели).
\subsection{Подготовка исходных данных}
\label{sec-4_3}


Сначала определяется какие качественные параметры будут использоваться в модели Эти параметры отвечают за конкретную процедуру выполнения каких либо операций.

Для определения диапазона изменения количественных параметров \ldots{} фактические данные об условиях, в которых будет работать или уже работает объект-оригинал. При этом т. к. большая часть параметров являются случайными величинами для создания их модели необходимо подобрать закон распределения этих величин.

Для каждого элемента системы существут функциональная связь между входным воздействием на него и его выходной характеристикой. Для некоторых элементов эта функциональная зависимость является очевидной, и её можно описать математическим выражением.

Для проверки правильности выбранного выражения для существующих систем проводятся сравнения расчётов по выражению и экспериментальных данных.

Если \ldots{} , то исследователь выдвигает гипотезы о возможных значениях параметров модели. При этом используются экспертные оценки, результаты исследования других система подобного назначения, личный опыт и интуиция создателей модели.

В конце этого этапа строится таблица, в которую заносятся все переменные и их значения.
