MS_Lectures.org
** Разработка математической модели

Цель создания математической модели:
1) Дать формализованное описание структруры и процесса функционирования системы для однозначности их понимания.
2) Представить процесс функционирования системы в виде, допускающем аналитическое исследование.

Для разработки математической модели может быть использован любой математический аппарат, который удобен для описание процессов в системе.

Наиболее широко исплользуется математический аппарат системы массвого обслуживания (для моделирования сетей связи), теории автоматов, дифференциальное и интегральное исчисление т. п.

** Разработка физической модели

При создании физической модели необходимо соблюдать 3 требования:
1) Подобие модели оригиналу, т. е. процесс протекающий в модели должен взаимооднозначно соответствовать процессу, протекающему в оригинале. На практике это требование трудно выполняемое, поэтому задаётся степень близости данных процессов.
2) Тождественность некоторых величин модели и оригинала. Это требование обуславливается необходимостью стыковки модели с реальной аппаратурой.
3) Требование специфики реализации модели. Эти требования задают отличия модели от оригинала, которые необходимы, чтобы эксперименты с моделью были дешёвыми и удобными.

** Разработка имитационной модель

Система разделяется на функциональные блоки и для каждого блока строится алгоритм его функционирования. Если некоторые блоки системы можно заменить математическим выражением, то это производится.

Т. к. имитационные модели чаще всего используются для определения каких-либо вероятностных характеристик, определяется в каких точках модели эти статистики вычислять. Для модели задаются начальные условия и определяются критерии для окончания процедуры моделирования.

В зависимости от изменения модельного времени существует 2 вида имитационных моделей:
1) С приращением временного интервала.
   - $\Delta t$ задаётся конкретной величине;
   - модельное время $t$ приравнивается 0;
   - выполняется изменение всех элементов в модели;
   - к модельному времени прибавляется $\Delta t$;
   - если время моделирования закончилось, то конец, если нет, то переход на шаг 3.
2) С продвижением времени до особых состояний.
   - создаётся список всех возможных состояний системы и время их наступления;
   - из этого списка выбирается самое раннее событие;
   - производятся действия --- реакции на это событие;
   - если моделирование закончилось, то конец, если нет, то переход на шаг 2.

** Выбор метода моделирования

Если построена математическая модель, то можно использовать 
- аналитический метод (решение уравнений в явном виде), 
- численные методы (решение уравнений для каких-то частных условий),
- качественные методы (применяются для оценки устойчивости систем, для ассимптотической оценки оцениваемой величины),
- имитационный метод

** Выбор средств моделирования

Средства моделирования бывают технические и программные.

* Пример

Необходимо смоделировать систему связи для оценки её помехоустойчивости к воздействию в виде гауссовского шуму.

Цель моделирования: необходимо определить какой из видов модуляции АМ, ЧМ, ФМ обеспечивает лучшую помехоустойчивость к гауссовскому шуму. Распределение по нормальному закону.

Уровень шума будет изменяться в процессе моделирования. Относительно уровня сигнала на входе КС.

Как моделировать каждый из блоков. В качестве источника информации генератор случайных чисел на основе рекуррентной линии задержки.

Полосовые фильтры моделируются путём свёртки входных сигналов с коэффициентами фильтра. Перед началом моделирования необходимо определится с порядком фильтра и вычислить его коэффициенты.

Модулятор реализуется путём вычисления уравнений для соответствующих видов модуляции. В модели необходимо определиться с несущей частотой сигналов, скоростью передачи.

Частота дискретизации.

Источник шума моделируется как генератор случайных чисел с нормальным законом распределения.

Особыми состояниями здесь будет генерация бита, появление промодулированной посылки на выходе модулятора, выход этой посылки из полосового фильтра.

