html/MS_Lectures.html

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> Разработка математической модели </h3>
<div class="outline-text-3" id="text-4_4">


<p>
Цель создания математической модели:
</p><ol>
<li>
Дать формализованное описание структруры и процесса функционирования системы для однозначности их понимания.
</li>
<li>
Представить процесс функционирования системы в виде, допускающем аналитическое исследование.
</li>
</ol>


<p>
Для разработки математической модели может быть использован любой математический аппарат, который удобен для описание процессов в системе.
</p>
<p>
Наиболее широко исплользуется математический аппарат системы массвого обслуживания (для моделирования сетей связи), теории автоматов, дифференциальное и интегральное исчисление т. п.
</p>
</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> Разработка физической модели </h3>
<div class="outline-text-3" id="text-4_5">


<p>
При создании физической модели необходимо соблюдать 3 требования:
</p><ol>
<li>
Подобие модели оригиналу, т. е. процесс протекающий в модели должен взаимооднозначно соответствовать процессу, протекающему в оригинале. На практике это требование трудно выполняемое, поэтому задаётся степень близости данных процессов.
</li>
<li>
Тождественность некоторых величин модели и оригинала. Это требование обуславливается необходимостью стыковки модели с реальной аппаратурой.
</li>
<li>
Требование специфики реализации модели. Эти требования задают отличия модели от оригинала, которые необходимы, чтобы эксперименты с моделью были дешёвыми и удобными.
</li>
</ol>


</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3">4.6</span> Разработка имитационной модель </h3>
<div class="outline-text-3" id="text-4_6">


<p>
Система разделяется на функциональные блоки и для каждого блока строится алгоритм его функционирования. Если некоторые блоки системы можно заменить математическим выражением, то это производится.
</p>
<p>
Т. к. имитационные модели чаще всего используются для определения каких-либо вероятностных характеристик, определяется в каких точках модели эти статистики вычислять. Для модели задаются начальные условия и определяются критерии для окончания процедуры моделирования.
</p>
<p>
В зависимости от изменения модельного времени существует 2 вида имитационных моделей:
</p><ol>
<li>
С приращением временного интервала.
<ul>
<li>
\(\Delta t\) задаётся конкретной величине;
</li>
<li>
модельное время \(t\) приравнивается 0;
</li>
<li>
выполняется изменение всех элементов в модели;
</li>
<li>
к модельному времени прибавляется \(\Delta t\);
</li>
<li>
если время моделирования закончилось, то конец, если нет, то переход на шаг 3.
</li>
</ul>
</li>
<li>
С продвижением времени до особых состояний.
<ul>
<li>
создаётся список всех возможных состояний системы и время их наступления;
</li>
<li>
из этого списка выбирается самое раннее событие;
</li>
<li>
производятся действия &mdash; реакции на это событие;
</li>
<li>
если моделирование закончилось, то конец, если нет, то переход на шаг 2.
</li>
</ul>
</li>
</ol>


</div>

</div>

<div id="outline-container-4_7" class="outline-3">
<h3 id="sec-4_7"><span class="section-number-3">4.7</span> Выбор метода моделирования </h3>
<div class="outline-text-3" id="text-4_7">


<p>
Если построена математическая модель, то можно использовать 
</p><ul>
<li>
аналитический метод (решение уравнений в явном виде), 
</li>
<li>
численные методы (решение уравнений для каких-то частных условий),
</li>
<li>
качественные методы (применяются для оценки устойчивости систем, для ассимптотической оценки оцениваемой величины),
</li>
<li>
имитационный метод
</li>
</ul>


</div>

</div>

<div id="outline-container-4_8" class="outline-3">
<h3 id="sec-4_8"><span class="section-number-3">4.8</span> Выбор средств моделирования </h3>
<div class="outline-text-3" id="text-4_8">


<p>
Средства моделирования бывают технические и программные.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Пример </h2>
<div class="outline-text-2" id="text-5">


<p>
Необходимо смоделировать систему связи для оценки её помехоустойчивости к воздействию в виде гауссовского шуму.
</p>
<p>
Цель моделирования: необходимо определить какой из видов модуляции АМ, ЧМ, ФМ обеспечивает лучшую помехоустойчивость к гауссовскому шуму. Распределение по нормальному закону.
</p>
<p>
Уровень шума будет изменяться в процессе моделирования. Относительно уровня сигнала на входе КС.
</p>
<p>
Как моделировать каждый из блоков. В качестве источника информации генератор случайных чисел на основе рекуррентной линии задержки.
</p>
<p>
Полосовые фильтры моделируются путём свёртки входных сигналов с коэффициентами фильтра. Перед началом моделирования необходимо определится с порядком фильтра и вычислить его коэффициенты.
</p>
<p>
Модулятор реализуется путём вычисления уравнений для соответствующих видов модуляции. В модели необходимо определиться с несущей частотой сигналов, скоростью передачи.
</p>
<p>
Частота дискретизации.
</p>
<p>
Источник шума моделируется как генератор случайных чисел с нормальным законом распределения.
</p>
<p>
Особыми состояниями здесь будет генерация бита, появление промодулированной посылки на выходе модулятора, выход этой посылки из полосового фильтра.
</p>
</div>

</div>
