other/MS_Lectures.tex
\subsection{Разработка математической модели}
\label{sec-4_4}


Цель создания математической модели:
\begin{enumerate}
\item Дать формализованное описание структруры и процесса функционирования системы для однозначности их понимания.
\item Представить процесс функционирования системы в виде, допускающем аналитическое исследование.
\end{enumerate}

Для разработки математической модели может быть использован любой математический аппарат, который удобен для описание процессов в системе.

Наиболее широко исплользуется математический аппарат системы массвого обслуживания (для моделирования сетей связи), теории автоматов, дифференциальное и интегральное исчисление т. п.
\subsection{Разработка физической модели}
\label{sec-4_5}


При создании физической модели необходимо соблюдать 3 требования:
\begin{enumerate}
\item Подобие модели оригиналу, т. е. процесс протекающий в модели должен взаимооднозначно соответствовать процессу, протекающему в оригинале. На практике это требование трудно выполняемое, поэтому задаётся степень близости данных процессов.
\item Тождественность некоторых величин модели и оригинала. Это требование обуславливается необходимостью стыковки модели с реальной аппаратурой.
\item Требование специфики реализации модели. Эти требования задают отличия модели от оригинала, которые необходимы, чтобы эксперименты с моделью были дешёвыми и удобными.
\end{enumerate}
\subsection{Разработка имитационной модель}
\label{sec-4_6}


Система разделяется на функциональные блоки и для каждого блока строится алгоритм его функционирования. Если некоторые блоки системы можно заменить математическим выражением, то это производится.

Т. к. имитационные модели чаще всего используются для определения каких-либо вероятностных характеристик, определяется в каких точках модели эти статистики вычислять. Для модели задаются начальные условия и определяются критерии для окончания процедуры моделирования.

В зависимости от изменения модельного времени существует 2 вида имитационных моделей:
\begin{enumerate}
\item С приращением временного интервала.

\begin{itemize}
\item $\Delta t$ задаётся конкретной величине;
\item модельное время $t$ приравнивается 0;
\item выполняется изменение всех элементов в модели;
\item к модельному времени прибавляется $\Delta t$;
\item если время моделирования закончилось, то конец, если нет, то переход на шаг 3.
\end{itemize}

\item С продвижением времени до особых состояний.

\begin{itemize}
\item создаётся список всех возможных состояний системы и время их наступления;
\item из этого списка выбирается самое раннее событие;
\item производятся действия --- реакции на это событие;
\item если моделирование закончилось, то конец, если нет, то переход на шаг 2.
\end{itemize}

\end{enumerate}
\subsection{Выбор метода моделирования}
\label{sec-4_7}


Если построена математическая модель, то можно использовать 
\begin{itemize}
\item аналитический метод (решение уравнений в явном виде),
\item численные методы (решение уравнений для каких-то частных условий),
\item качественные методы (применяются для оценки устойчивости систем, для ассимптотической оценки оцениваемой величины),
\item имитационный метод
\end{itemize}
\subsection{Выбор средств моделирования}
\label{sec-4_8}


Средства моделирования бывают технические и программные.
\section{Пример}
\label{sec-5}


Необходимо смоделировать систему связи для оценки её помехоустойчивости к воздействию в виде гауссовского шуму.

Цель моделирования: необходимо определить какой из видов модуляции АМ, ЧМ, ФМ обеспечивает лучшую помехоустойчивость к гауссовскому шуму. Распределение по нормальному закону.

Уровень шума будет изменяться в процессе моделирования. Относительно уровня сигнала на входе КС.

Как моделировать каждый из блоков. В качестве источника информации генератор случайных чисел на основе рекуррентной линии задержки.

Полосовые фильтры моделируются путём свёртки входных сигналов с коэффициентами фильтра. Перед началом моделирования необходимо определится с порядком фильтра и вычислить его коэффициенты.

Модулятор реализуется путём вычисления уравнений для соответствующих видов модуляции. В модели необходимо определиться с несущей частотой сигналов, скоростью передачи.

Частота дискретизации.

Источник шума моделируется как генератор случайных чисел с нормальным законом распределения.

Особыми состояниями здесь будет генерация бита, появление промодулированной посылки на выходе модулятора, выход этой посылки из полосового фильтра.
