html/MS_Lectures.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Испытание модели </h2>
<div class="outline-text-2" id="text-6">


<p>
Сначала задаётся исходная информация для моделирования. Для существующей системы измеряются характеристики системы и входные воздействия на неё. На основании этих данных задаётся диапазон изменения параметров модели и внешних воздействий на неё. Если модель строится для несуществующей системы, то исходная информация берётся от прототипов системы, а если их нет, то используются экспертные оценки.
</p>
<p>
После задания исходных данных начинается <i>верификация</i> имитационной модели. Верификация &mdash; это доказательство соответствия алгоритма её функционирования замыслу моделирования путём формальных и неформальных исследований реализованной программы или макета.
</p>
<p>
Формальные методы:
</p><ol>
<li>
Замена некоторых вероятностных элементов модели на детерминированные и проверка на "ожидаемость" процесса моделирования.
</li>
<li>
Использование специальных анализаторов текстов программ. Эти анализаторы выявляют логические ошибки в тексте.
</li>
<li>
Тест на "непрерывность" моделирования. В ходе этого теста проверяется соответствие выходных характеристик воздействиям на входе модели по всему диапазону значений параметров модели.
</li>
</ol>


<p>
После проверки верификации начинается проверка адекватности модели. Эти процедуры возможны, только если модель построена для реальной системы.
</p>
<p>
Сначала на реальной системе проводится ряд экспериментов, в которых измеряются выходные характеристики системы при заданных внешних воздействиях. Затем в модели задают те же внешние воздействия и измеряют значения на выходе модели. Потом начинается их сравнение.
</p>
<p>
Сравнение полученных результатов может выполняться:
</p><ol>
<li>
По средним значениям отклика модели и системы. В этом случае вычисляются математическое ожидание и дисперсия для откликов реальной системы и откликов модели.
</li>
</ol>




\(M(y_p) = \frac{1}{N_p}\sum_{k=1}^{N_p}y_p(k)\)

\(D(y_p) = \frac{1}{N_p-1}\sum_{k=1}^{N_p}(y_p(k)-M(y_p))^2\)

\(D = \frac{(N_m - 1)D(y_p) + (N_p - 1 ) D(y_m)}{N_m + N_p -2}\)

\(R = M(y_p) - M(y_m)\)

<p>
В статистике величины \(D\) и \(R\) считаются независимыми, поэтому для оценки адекватности используется Т-статистика.
</p>


\(t_n = R\sqrt{\frac{N_m N_p}{D(N_m + N_p)}}\)

<p>
Вычисленное значение \(t_n\) сравнивается со значение \(t_{text{кр}}\). Если больше, то модель неадекватна. \(t_\text{{кр}}\) выбирается по таблице Стьюдента.
</p>
<p>
Величина \(\alpha\) называется уровнем зависимости. Для расчетов его принимают 0,05. Второе число \(\gamma\) называется степень свободы.
</p>
<p>
Число опытов обычно берётся несколько десятков.
</p>
<ol>
<li>
По дисперсиям отклонений откликов модели от среднего значения откликов системы.
</li>
</ol>


<p>
В этом случае определяются математическое ожидание для системы.
</p>


\(D_{\text{отк}}(y) = \frac{1}{N_m - 1} \sum_{k = 1}^{N_m}(y_m(k) - M(y_p))^2\)

<p>
Затем вычисляется дисперсиям для реальной системы.
</p>
<p>
Если значение \(F\) меньше критической, то модель адекватна, если больше, то модель неадекватна. \(F\) критическое выбирается из таблиц. \(\alpha\) остаётся 0,05. \(\gamma\) будет \(N\) модели
</p>
<ol>
<li>
По максимальному значению абсолютных отклонений откликов модели от откликов системы.
</li>
</ol>




\(\Delta y = max \frac{|y_m(k) - y_p(k)|}{M(y_p)}\)

<p>
В этом способе число опытов на модели должно равняться числу опытов на реальной модели. Задаётся допустимая величина \(\delta y\), если меньше ли равно допустимой величине отклонения, то модель является адекватной.
</p>
<p>
Проверка адекватности происходит для каждого компонента модели. Если хотя бы по одному из откликов модель становится неадекватной, то она вся бракуется
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Исследование свойств модели </h2>
<div class="outline-text-2" id="text-7">



</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Проверка генераторов ПСЧ, используемых в модели: </h3>
<div class="outline-text-3" id="text-7_1">



</div>

<div id="outline-container-7_1_1" class="outline-4">
<h4 id="sec-7_1_1"><span class="section-number-4">7.1.1</span> Проверка соответствия закону распределения. </h4>
<div class="outline-text-4" id="text-7_1_1">


<p>
Для этих целей используются критерии хи квадрат. От генератора получается выборка чисел. Все полученные числа разбиваются по интервалам и считается сколько чисел в каждом интервале. Затем полученное распределение чисел сравнивается с теоретическим по формуле: (1).
</p>
<p>
r - число интервалов, n - число чисел в интервале, N - теоретическое значение. Длина интервалов выбирается т. о., чтобы N в каждом интервале было одинаковым. Полученное значение хи квадрат сравнивается с табличным. Если вычисленное значение меньше табличного, значит генератор вырабатывает значения с требуемым законом распределения.
</p>
</div>

</div>

<div id="outline-container-7_1_2" class="outline-4">
<h4 id="sec-7_1_2"><span class="section-number-4">7.1.2</span> Проверка корреляции чисел </h4>
<div class="outline-text-4" id="text-7_1_2">


<p>
Для этого необходимо вычислить значение автокорреляционной функции для последовательности чисел, выработанной генератором.
</p>
</div>

</div>

<div id="outline-container-7_1_3" class="outline-4">
<h4 id="sec-7_1_3"><span class="section-number-4">7.1.3</span> Комбинаторный тест </h4>
<div class="outline-text-4" id="text-7_1_3">


<p>
Вычисляются вероятности появления заданных комбинаций чисел сгенерированной последовательности.
</p>
<p>
В имитационной модели для каждого источника (информационного сигнала, шума и т. д.) необходимо использовать отдельный генератор случайных чисел для того, чтобы обеспечить статистическую независимость моделируемых процессов.
</p>
<p>
Период вырабатываемой последовательности должен быть больше, чем планируемый объём выборки во всех экспериментах с моделью.
</p>
</div>
</div>

</div>
