other/MS_Lectures.tex
\section{Испытание модели}
\label{sec-6}


Сначала задаётся исходная информация для моделирования. Для существующей системы измеряются характеристики системы и входные воздействия на неё. На основании этих данных задаётся диапазон изменения параметров модели и внешних воздействий на неё. Если модель строится для несуществующей системы, то исходная информация берётся от прототипов системы, а если их нет, то используются экспертные оценки.

После задания исходных данных начинается \emph{верификация} имитационной модели. Верификация --- это доказательство соответствия алгоритма её функционирования замыслу моделирования путём формальных и неформальных исследований реализованной программы или макета.

Формальные методы:
\begin{enumerate}
\item Замена некоторых вероятностных элементов модели на детерминированные и проверка на ``ожидаемость'' процесса моделирования.
\item Использование специальных анализаторов текстов программ. Эти анализаторы выявляют логические ошибки в тексте.
\item Тест на ``непрерывность'' моделирования. В ходе этого теста проверяется соответствие выходных характеристик воздействиям на входе модели по всему диапазону значений параметров модели.
\end{enumerate}

После проверки верификации начинается проверка адекватности модели. Эти процедуры возможны, только если модель построена для реальной системы.

Сначала на реальной системе проводится ряд экспериментов, в которых измеряются выходные характеристики системы при заданных внешних воздействиях. Затем в модели задают те же внешние воздействия и измеряют значения на выходе модели. Потом начинается их сравнение.

Сравнение полученных результатов может выполняться:
\begin{enumerate}
\item По средним значениям отклика модели и системы. В этом случае вычисляются математическое ожидание и дисперсия для откликов реальной системы и откликов модели.
\end{enumerate}

$M(y_p) = \frac{1}{N_p}\sum_{k=1}^{N_p}y_p(k)$

$D(y_p) = \frac{1}{N_p-1}\sum_{k=1}^{N_p}(y_p(k)-M(y_p))^2$

$D = \frac{(N_m - 1)D(y_p) + (N_p - 1 ) D(y_m)}{N_m + N_p -2}$

$R = M(y_p) - M(y_m)$

В статистике величины $D$ и $R$ считаются независимыми, поэтому для оценки адекватности используется Т-статистика.

$t_n = R\sqrt{\frac{N_m N_p}{D(N_m + N_p)}}$

Вычисленное значение $t_n$ сравнивается со значение $t_{text{кр}}$. Если больше, то модель неадекватна. $t_\text{{кр}}$ выбирается по таблице Стьюдента.

Величина $\alpha$ называется уровнем зависимости. Для расчетов его принимают 0,05. Второе число $\gamma$ называется степень свободы.

Число опытов обычно берётся несколько десятков.

\begin{enumerate}
\item По дисперсиям отклонений откликов модели от среднего значения откликов системы.
\end{enumerate}

В этом случае определяются математическое ожидание для системы.

$D_{\text{отк}}(y) = \frac{1}{N_m - 1} \sum_{k = 1}^{N_m}(y_m(k) - M(y_p))^2$

Затем вычисляется дисперсиям для реальной системы.

Если значение $F$ меньше критической, то модель адекватна, если больше, то модель неадекватна. $F$ критическое выбирается из таблиц. $\alpha$ остаётся 0,05. $\gamma$ будет $N$ модели

\begin{enumerate}
\item По максимальному значению абсолютных отклонений откликов модели от откликов системы.
\end{enumerate}

$\Delta y = max \frac{|y_m(k) - y_p(k)|}{M(y_p)}$

В этом способе число опытов на модели должно равняться числу опытов на реальной модели. Задаётся допустимая величина $\delta y$, если меньше ли равно допустимой величине отклонения, то модель является адекватной.

Проверка адекватности происходит для каждого компонента модели. Если хотя бы по одному из откликов модель становится неадекватной, то она вся бракуется
\section{Исследование свойств модели}
\label{sec-7}
\subsection{Проверка генераторов ПСЧ, используемых в модели:}
\label{sec-7_1}
\subsubsection{Проверка соответствия закону распределения.}
\label{sec-7_1_1}


Для этих целей используются критерии хи квадрат. От генератора получается выборка чисел. Все полученные числа разбиваются по интервалам и считается сколько чисел в каждом интервале. Затем полученное распределение чисел сравнивается с теоретическим по формуле: (1).

r - число интервалов, n - число чисел в интервале, N - теоретическое значение. Длина интервалов выбирается т. о., чтобы N в каждом интервале было одинаковым. Полученное значение хи квадрат сравнивается с табличным. Если вычисленное значение меньше табличного, значит генератор вырабатывает значения с требуемым законом распределения.
\subsubsection{Проверка корреляции чисел}
\label{sec-7_1_2}


Для этого необходимо вычислить значение автокорреляционной функции для последовательности чисел, выработанной генератором.
\subsubsection{Комбинаторный тест}
\label{sec-7_1_3}


Вычисляются вероятности появления заданных комбинаций чисел сгенерированной последовательности.

В имитационной модели для каждого источника (информационного сигнала, шума и т. д.) необходимо использовать отдельный генератор случайных чисел для того, чтобы обеспечить статистическую независимость моделируемых процессов.

Период вырабатываемой последовательности должен быть больше, чем планируемый объём выборки во всех экспериментах с моделью.
