MS_Lectures.org
** Определение длительности переходного режима в модели

В большинстве моделей необходимо несколько шагов, чтобы модель перешла в устойчивое состояние. Пример --- заполнение линии задержки фильтра.

Существует 3 способа уменьшения влияния переходного процесса:

1) Использование длинных прогонов модели.
2) Исключение из рассмотрения начального периода. Исследователь должен точно знать, когда закончатся переходные процессы.
3) Выбор НУ, соответствующих выбранному режиму.

** Оценка дисперсии результатов моделирования

Чем больше объем выборки, тем меньше должна быть дисперсия. Если это условие не выполняется, значит в модели присутствует ошибка.

** Планирование экспериментов

Эксперименты бывают 3 типов:
1) Сравнение средних и дисперсий различных альтернатив. Это самый простой тип экспериментов.
2) Определение важности учёта или значимости влияния переменных и ограничений, наложенных на эти переменные. В этом типе важность того или иного фактора ранжируется по убыванию. После ранжирования выявляются несущественные факторы, которыми можно будет пренебрегать.
3) Отыскание оптимальных значений среди некоторого множества.

** Определение требуемого размера выборки

Определение требуемого размера выборки основано на вычислении доверительного интервала для какой-то заданной доверительной вероятности.

Обычно доверительную вероятность задают 0,9, 0,95, 0,99.

$d = K_{\gamma} \sqrt{\frac{D}{N}}$

$D$ --- дисперсия.

$N$ --- число опытов.

$k$ --- коэффициент из таблицы.

Проводится $N$ опытов. По их результатам вычисляется мат. ожидание и дисперсия исследуемой величины. По этой формуле вычисляется значение доверительного интервала. Если $d$ не удовлетворяет предъявленным требования, то вся процедура повторяется, но увеличивается число $N$.

$d = K_{\gamma} \sqrt{\frac{P^{*}(1-P^{*})}{N}}$

$P^{*}$ --- вероятность.

$N = 10$. $D = 0.1$. $M = 5$. $K_{\gamma} = 1.54$

$d = 0.0146$. От $M$ составляет 3%.

$N = 1000$. $P = 0.1$

$d = 1.54 \sqrt{\frac{0.1(1-0.1)}{1000}} = 0.0095$

Нужно увеличить объём выборки. 9.4%.

$N = \frac{P^*(1-P^*)}{(\frac{d}{K})^2}$

** Определение интервалов изменения параметров

Существуют 3 основных фактора для определения этих интервалов:
1) Необходимость получения одинаковой относительной точности статистик на разных участках области измерения параметров модели.
2) Характер функции отклика.
3) Назначение имитационного эксперимента.

Сначала задаются предельные значения параметров (максимальные и минимальные). Если приблизительный вид функции отклика известен, то значение параметров выбираются с учётом особых точек этой известной функции.

Если функция неизвестна, исследователю остаётся полагаться на здравый смысл и интуицию. Сначала с большим шагом, в интересующих местах шаг уменьшается.

* Документация результатов моделирования

Документация должна содержать:
1) Точную формулировку цели моделирования.
2) Математическое определение, состав предположений и формулировку задач моделирования.
3) Полный набор входных данных моделирования.
4) Полный набор алгоритмов для модели.
5) Описание стандартных программ и методик, используемых в модели.
6) Текст программ с комментариями.
7) Имена разработчиков и руководителей, ответственных за разработку.

Для эксплуатации модели создаётся набор эксплуатационных измерений. В этих документах содержаться:
1) Допущения, ограничения на входные параметры.
2) Ожидаемые результаты моделирования.
3) План эксплуатации модели. Какие эксперименты и в каком количестве произвести.

Результаты, полученные в ходе моделирования, представляются в виде таблиц и графиков.

Для заказчика составляются специальные документы по обучению работы с моделью. В него входят:
- руководство пользователя;
- руководство аналитика. Включается информация о разработке программы с тем, чтобы её можно было модифицировать;
- резюме исполнителя, облегчающее интерпретацию результатов лицу, принимающему проектное решение.
- список пользователей, привлечённых к работе с моделью.

