html/MS_Lectures.html

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> Определение длительности переходного режима в модели </h3>
<div class="outline-text-3" id="text-7_2">


<p>
В большинстве моделей необходимо несколько шагов, чтобы модель перешла в устойчивое состояние. Пример &mdash; заполнение линии задержки фильтра.
</p>
<p>
Существует 3 способа уменьшения влияния переходного процесса:
</p>
<ol>
<li>
Использование длинных прогонов модели.
</li>
<li>
Исключение из рассмотрения начального периода. Исследователь должен точно знать, когда закончатся переходные процессы.
</li>
<li>
Выбор НУ, соответствующих выбранному режиму.
</li>
</ol>


</div>

</div>

<div id="outline-container-7_3" class="outline-3">
<h3 id="sec-7_3"><span class="section-number-3">7.3</span> Оценка дисперсии результатов моделирования </h3>
<div class="outline-text-3" id="text-7_3">


<p>
Чем больше объем выборки, тем меньше должна быть дисперсия. Если это условие не выполняется, значит в модели присутствует ошибка.
</p>
</div>

</div>

<div id="outline-container-7_4" class="outline-3">
<h3 id="sec-7_4"><span class="section-number-3">7.4</span> Планирование экспериментов </h3>
<div class="outline-text-3" id="text-7_4">


<p>
Эксперименты бывают 3 типов:
</p><ol>
<li>
Сравнение средних и дисперсий различных альтернатив. Это самый простой тип экспериментов.
</li>
<li>
Определение важности учёта или значимости влияния переменных и ограничений, наложенных на эти переменные. В этом типе важность того или иного фактора ранжируется по убыванию. После ранжирования выявляются несущественные факторы, которыми можно будет пренебрегать.
</li>
<li>
Отыскание оптимальных значений среди некоторого множества.
</li>
</ol>


</div>

</div>

<div id="outline-container-7_5" class="outline-3">
<h3 id="sec-7_5"><span class="section-number-3">7.5</span> Определение требуемого размера выборки </h3>
<div class="outline-text-3" id="text-7_5">


<p>
Определение требуемого размера выборки основано на вычислении доверительного интервала для какой-то заданной доверительной вероятности.
</p>
<p>
Обычно доверительную вероятность задают 0,9, 0,95, 0,99.
</p>


\(d = K_{\gamma} \sqrt{\frac{D}{N}}\)

\(D\) --- дисперсия.

\(N\) --- число опытов.

\(k\) --- коэффициент из таблицы.

<p>
Проводится \(N\) опытов. По их результатам вычисляется мат. ожидание и дисперсия исследуемой величины. По этой формуле вычисляется значение доверительного интервала. Если \(d\) не удовлетворяет предъявленным требования, то вся процедура повторяется, но увеличивается число \(N\).
</p>


\(d = K_{\gamma} \sqrt{\frac{P^{*}(1-P^{*})}{N}}\)

\(P^{*}\) --- вероятность.

\(N = 10\). \(D = 0.1\). \(M = 5\). \(K_{\gamma} = 1.54\)

\(d = 0.0146\). От \(M\) составляет 3%.

\(N = 1000\). \(P = 0.1\)

\(d = 1.54 \sqrt{\frac{0.1(1-0.1)}{1000}} = 0.0095\)

<p>
Нужно увеличить объём выборки. 9.4%.
</p>


\(N = \frac{P^*(1-P^*)}{(\frac{d}{K})^2}\)

</div>

</div>

<div id="outline-container-7_6" class="outline-3">
<h3 id="sec-7_6"><span class="section-number-3">7.6</span> Определение интервалов изменения параметров </h3>
<div class="outline-text-3" id="text-7_6">


<p>
Существуют 3 основных фактора для определения этих интервалов:
</p><ol>
<li>
Необходимость получения одинаковой относительной точности статистик на разных участках области измерения параметров модели.
</li>
<li>
Характер функции отклика.
</li>
<li>
Назначение имитационного эксперимента.
</li>
</ol>


<p>
Сначала задаются предельные значения параметров (максимальные и минимальные). Если приблизительный вид функции отклика известен, то значение параметров выбираются с учётом особых точек этой известной функции.
</p>
<p>
Если функция неизвестна, исследователю остаётся полагаться на здравый смысл и интуицию. Сначала с большим шагом, в интересующих местах шаг уменьшается.
</p>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Документация результатов моделирования </h2>
<div class="outline-text-2" id="text-8">


<p>
Документация должна содержать:
</p><ol>
<li>
Точную формулировку цели моделирования.
</li>
<li>
Математическое определение, состав предположений и формулировку задач моделирования.
</li>
<li>
Полный набор входных данных моделирования.
</li>
<li>
Полный набор алгоритмов для модели.
</li>
<li>
Описание стандартных программ и методик, используемых в модели.
</li>
<li>
Текст программ с комментариями.
</li>
<li>
Имена разработчиков и руководителей, ответственных за разработку.
</li>
</ol>


<p>
Для эксплуатации модели создаётся набор эксплуатационных измерений. В этих документах содержаться:
</p><ol>
<li>
Допущения, ограничения на входные параметры.
</li>
<li>
Ожидаемые результаты моделирования.
</li>
<li>
План эксплуатации модели. Какие эксперименты и в каком количестве произвести.
</li>
</ol>


<p>
Результаты, полученные в ходе моделирования, представляются в виде таблиц и графиков.
</p>
<p>
Для заказчика составляются специальные документы по обучению работы с моделью. В него входят:
</p><ul>
<li>
руководство пользователя;
</li>
<li>
руководство аналитика. Включается информация о разработке программы с тем, чтобы её можно было модифицировать;
</li>
<li>
резюме исполнителя, облегчающее интерпретацию результатов лицу, принимающему проектное решение.
</li>
<li>
список пользователей, привлечённых к работе с моделью.
</li>
</ul>


</div>

</div>
