other/MS_Lectures.tex
\subsection{Определение длительности переходного режима в модели}
\label{sec-7_2}


В большинстве моделей необходимо несколько шагов, чтобы модель перешла в устойчивое состояние. Пример --- заполнение линии задержки фильтра.

Существует 3 способа уменьшения влияния переходного процесса:

\begin{enumerate}
\item Использование длинных прогонов модели.
\item Исключение из рассмотрения начального периода. Исследователь должен точно знать, когда закончатся переходные процессы.
\item Выбор НУ, соответствующих выбранному режиму.
\end{enumerate}
\subsection{Оценка дисперсии результатов моделирования}
\label{sec-7_3}


Чем больше объем выборки, тем меньше должна быть дисперсия. Если это условие не выполняется, значит в модели присутствует ошибка.
\subsection{Планирование экспериментов}
\label{sec-7_4}


Эксперименты бывают 3 типов:
\begin{enumerate}
\item Сравнение средних и дисперсий различных альтернатив. Это самый простой тип экспериментов.
\item Определение важности учёта или значимости влияния переменных и ограничений, наложенных на эти переменные. В этом типе важность того или иного фактора ранжируется по убыванию. После ранжирования выявляются несущественные факторы, которыми можно будет пренебрегать.
\item Отыскание оптимальных значений среди некоторого множества.
\end{enumerate}
\subsection{Определение требуемого размера выборки}
\label{sec-7_5}


Определение требуемого размера выборки основано на вычислении доверительного интервала для какой-то заданной доверительной вероятности.

Обычно доверительную вероятность задают 0,9, 0,95, 0,99.

$d = K_{\gamma} \sqrt{\frac{D}{N}}$

$D$ --- дисперсия.

$N$ --- число опытов.

$k$ --- коэффициент из таблицы.

Проводится $N$ опытов. По их результатам вычисляется мат. ожидание и дисперсия исследуемой величины. По этой формуле вычисляется значение доверительного интервала. Если $d$ не удовлетворяет предъявленным требования, то вся процедура повторяется, но увеличивается число $N$.

$d = K_{\gamma} \sqrt{\frac{P^{*}(1-P^{*})}{N}}$

$P^{*}$ --- вероятность.

$N = 10$. $D = 0.1$. $M = 5$. $K_{\gamma} = 1.54$

$d = 0.0146$. От $M$ составляет 3\%.

$N = 1000$. $P = 0.1$

$d = 1.54 \sqrt{\frac{0.1(1-0.1)}{1000}} = 0.0095$

Нужно увеличить объём выборки. 9.4\%.

$N = \frac{P^*(1-P^*)}{(\frac{d}{K})^2}$
\subsection{Определение интервалов изменения параметров}
\label{sec-7_6}


Существуют 3 основных фактора для определения этих интервалов:
\begin{enumerate}
\item Необходимость получения одинаковой относительной точности статистик на разных участках области измерения параметров модели.
\item Характер функции отклика.
\item Назначение имитационного эксперимента.
\end{enumerate}

Сначала задаются предельные значения параметров (максимальные и минимальные). Если приблизительный вид функции отклика известен, то значение параметров выбираются с учётом особых точек этой известной функции.

Если функция неизвестна, исследователю остаётся полагаться на здравый смысл и интуицию. Сначала с большим шагом, в интересующих местах шаг уменьшается.
\section{Документация результатов моделирования}
\label{sec-8}


Документация должна содержать:
\begin{enumerate}
\item Точную формулировку цели моделирования.
\item Математическое определение, состав предположений и формулировку задач моделирования.
\item Полный набор входных данных моделирования.
\item Полный набор алгоритмов для модели.
\item Описание стандартных программ и методик, используемых в модели.
\item Текст программ с комментариями.
\item Имена разработчиков и руководителей, ответственных за разработку.
\end{enumerate}

Для эксплуатации модели создаётся набор эксплуатационных измерений. В этих документах содержаться:
\begin{enumerate}
\item Допущения, ограничения на входные параметры.
\item Ожидаемые результаты моделирования.
\item План эксплуатации модели. Какие эксперименты и в каком количестве произвести.
\end{enumerate}

Результаты, полученные в ходе моделирования, представляются в виде таблиц и графиков.

Для заказчика составляются специальные документы по обучению работы с моделью. В него входят:
\begin{itemize}
\item руководство пользователя;
\item руководство аналитика. Включается информация о разработке программы с тем, чтобы её можно было модифицировать;
\item резюме исполнителя, облегчающее интерпретацию результатов лицу, принимающему проектное решение.
\item список пользователей, привлечённых к работе с моделью.
\end{itemize}
