MS_Lectures.org
* Лабораторные работы

Необходимо смоделировать систему связи для оценки её помехоустойчивости к воздействию импульсных помех.

Цель моделирования: необходимо определить какой из видов модуляции АМ, ЧМ, ФМ обеспечивает лучшую помехоустойчивость к воздействию импульсных помех.

Объект моделирования --- система связи с воздействием импульсных помех в канале связи.

1) Источником информации является текст, состоящий из букв русского алфавита.
2) Кодер представляет собой таблицу перевода символов русского алфавита в код МТК2.
3) Модулятор реализует 3 вида модуляции:
   - амплитудная. U_1 = Usin(wt), U_0 = 0.
   - частотная. U_1 = Usin(w_1t), U_0 = Usin(w_2t).
   - фазовая. U_1 = Usin(w_0t), U_2 = Usin(w_0 + \pi)
4) Канал ТЧ. Аналоговый канал по которому передаётся манипулированный сигнал. На сигнал в канале воздействует имплульсная помеха.
5) Демодулятор. Происходит преобразование аналогового сигнала в цифровой вид.
6) Декодер. Обратное преобразование кода МТК2 в символы русского алфавита.
7) На приёме --- текст, состоящий из букв русского алфавита.

В модели сравниваются буквы на приёме и передаче, на основе чего делается вывод о воздействии имплульсной помехи при различных видах модуляции.

Импульсными помехами называют случайные кратковременные искажения амплитуды сигнала. Импульсные помехи проявляются в виде резких, "неестественных" выбросов амплитуды отдельных небольших групп отсчетов наблюдаемого сигнала. Импульсная помеха описывается амплитудой и скважностью. Скважность характеризует "плотность" импульсных помех в сигнале и определяется как отношение длительности импульсной помехи к средней величине длительности интервала между соседними помехами. Данные параметры задаются в процессе моделирования.
