html/MS_Lectures.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Лабораторные работы </h2>
<div class="outline-text-2" id="text-9">


<p>
Необходимо смоделировать систему связи для оценки её помехоустойчивости к воздействию импульсных помех.
</p>
<p>
Цель моделирования: необходимо определить какой из видов модуляции АМ, ЧМ, ФМ обеспечивает лучшую помехоустойчивость к воздействию импульсных помех.
</p>
<p>
Объект моделирования &mdash; система связи с воздействием импульсных помех в канале связи.
</p>
<ol>
<li>
Источником информации является текст, состоящий из букв русского алфавита.
</li>
<li>
Кодер представляет собой таблицу перевода символов русского алфавита в код МТК2.
</li>
<li>
Модулятор реализует 3 вида модуляции:
<ul>
<li>
амплитудная. U<sub>1</sub> = Usin(wt), U<sub>0</sub> = 0.
</li>
<li>
частотная. U<sub>1</sub> = Usin(w<sub>1t</sub>), U<sub>0</sub> = Usin(w<sub>2t</sub>).
</li>
<li>
фазовая. U<sub>1</sub> = Usin(w<sub>0t</sub>), U<sub>2</sub> = Usin(w<sub>0</sub> + &pi;)
</li>
</ul>
</li>
<li>
Канал ТЧ. Аналоговый канал по которому передаётся манипулированный сигнал. На сигнал в канале воздействует имплульсная помеха.
</li>
<li>
Демодулятор. Происходит преобразование аналогового сигнала в цифровой вид.
</li>
<li>
Декодер. Обратное преобразование кода МТК2 в символы русского алфавита.
</li>
<li>
На приёме &mdash; текст, состоящий из букв русского алфавита.
</li>
</ol>


<p>
В модели сравниваются буквы на приёме и передаче, на основе чего делается вывод о воздействии имплульсной помехи при различных видах модуляции.
</p>
<p>
Импульсными помехами называют случайные кратковременные искажения амплитуды сигнала. Импульсные помехи проявляются в виде резких, "неестественных" выбросов амплитуды отдельных небольших групп отсчетов наблюдаемого сигнала. Импульсная помеха описывается амплитудой и скважностью. Скважность характеризует "плотность" импульсных помех в сигнале и определяется как отношение длительности импульсной помехи к средней величине длительности интервала между соседними помехами. Данные параметры задаются в процессе моделирования.
</p>

</div>
</div>
<div id="postamble">
<p class="author"> Author: Максим Захаров
</p>
<p class="date"> Date: 2011-01-04 14:43:08 MSK</p>
<p class="creator">HTML generated by org-mode 7.5 in emacs 23</p>
</div>
</div>
</body>
</html>
