other/MS_Lectures.tex
\section{Лабораторные работы}
\label{sec-9}


Необходимо смоделировать систему связи для оценки её помехоустойчивости к воздействию импульсных помех.

Цель моделирования: необходимо определить какой из видов модуляции АМ, ЧМ, ФМ обеспечивает лучшую помехоустойчивость к воздействию импульсных помех.

Объект моделирования --- система связи с воздействием импульсных помех в канале связи.

\begin{enumerate}
\item Источником информации является текст, состоящий из букв русского алфавита.
\item Кодер представляет собой таблицу перевода символов русского алфавита в код МТК2.
\item Модулятор реализует 3 вида модуляции:

\begin{itemize}
\item амплитудная. U$_1$ = Usin(wt), U$_0$ = 0.
\item частотная. U$_1$ = Usin(w$_{\mathrm{1t}}$), U$_0$ = Usin(w$_{\mathrm{2t}}$).
\item фазовая. U$_1$ = Usin(w$_{\mathrm{0t}}$), U$_2$ = Usin(w$_0$ + $\pi$)
\end{itemize}

\item Канал ТЧ. Аналоговый канал по которому передаётся манипулированный сигнал. На сигнал в канале воздействует имплульсная помеха.
\item Демодулятор. Происходит преобразование аналогового сигнала в цифровой вид.
\item Декодер. Обратное преобразование кода МТК2 в символы русского алфавита.
\item На приёме --- текст, состоящий из букв русского алфавита.
\end{enumerate}

В модели сравниваются буквы на приёме и передаче, на основе чего делается вывод о воздействии имплульсной помехи при различных видах модуляции.

Импульсными помехами называют случайные кратковременные искажения амплитуды сигнала. Импульсные помехи проявляются в виде резких, ``неестественных'' выбросов амплитуды отдельных небольших групп отсчетов наблюдаемого сигнала. Импульсная помеха описывается амплитудой и скважностью. Скважность характеризует ``плотность'' импульсных помех в сигнале и определяется как отношение длительности импульсной помехи к средней величине длительности интервала между соседними помехами. Данные параметры задаются в процессе моделирования.

\end{document}
